Revit 2027 API
IndexTriangle.GetSizeInShortInts Method
 Gets the amount of storage that the primitive takes up in a buffer, measured in short integers.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static int GetSizeInShortInts()
Public Shared Function GetSizeInShortInts As Integer
public:
static int GetSizeInShortInts()
static member GetSizeInShortInts : unit -> int
Return Value
Int32
 The number of short integers occupied by the primitive.
See Also
Reference
IndexTriangle Class
Autodesk.Revit.DB.DirectContext3D Namespace